In [1]:
import pandas as pd

In [30]:
# save data as variables
uber = pd.read_csv('uber-raw-data-june-15.csv')
zone = pd.read_csv('taxi_zone_lookup.csv')

In [31]:
# check data quickly
uber

,Unnamed: 0,Dispatching_base_num,Pickup_date,Affiliated_base_num,locationID
0,1,B02764,2015-06-01 10:25:00,B02682,107
1,2,B02764,2015-06-01 10:25:00,B02764,170
2,3,B02764,2015-06-01 10:25:00,B02764,237
3,4,B02764,2015-06-01 10:25:00,B02764,229
4,5,B02764,2015-06-01 10:25:00,B00013,50
...,...,...,...,...,...
2816890,2816891,B02836,2015-06-30 22:51:00,B02836,143
2816891,2816892,B02836,2015-06-30 22:52:00,B02836,90
2816892,2816893,B02836,2015-06-30 23:06:00,B02836,246
2816893,2816894,B02836,2015-06-30 23:20:00,B02836,107
2816894,2816895,B02836,2015-06-30 23:29:00,B02836,144

In [32]:
# re-name zone data columns
zone.columns = ['locationID', 'borough', 'zone', 'service_zone']

In [33]:
zone.head()

   locationID        borough                     zone service_zone
0           1            EWR           Newark Airport          EWR
1           2         Queens              Jamaica Bay    Boro Zone
2           3          Bronx  Allerton/Pelham Gardens    Boro Zone
3           4      Manhattan            Alphabet City  Yellow Zone
4           5  Staten Island            Arden Heights    Boro Zone

In [34]:
# group uber data by locationID and produce count
uber.groupby(by='locationID').count()

            Unnamed: 0  Dispatching_base_num  Pickup_date  Affiliated_base_num
locationID
1                   29                    29           29                   29
2                    1                     1            1                    1
3                  860                   860          860                  860
4                17608                 17608        17608                17608
5                   10                    10           10                   10
...                ...                   ...          ...                  ...
260               4481                  4481         4481                 4481
261              14239                 14239        14239                14239
262              20909                 20909        20909                20909
263              25910                 25910        25910                25910
265               1476                  1476         1476                 1476

[259 rows x 4 columns]

In [35]:
# merge uber data with zone data on locationID
uber1 = uber.merge(zone, how='outer', on='locationID')

In [36]:
uber1

,Unnamed: 0,Dispatching_base_num,Pickup_date,Affiliated_base_num,locationID,borough,zone,service_zone
0,1.0,B02764,2015-06-01 10:25:00,B02682,107,Manhattan,Gramercy,Yellow Zone
1,14.0,B02764,2015-06-01 10:26:00,B02764,107,Manhattan,Gramercy,Yellow Zone
2,54.0,B02764,2015-06-01 10:28:00,B00035,107,Manhattan,Gramercy,Yellow Zone
3,83.0,B02764,2015-06-01 10:29:00,B02253,107,Manhattan,Gramercy,Yellow Zone
4,108.0,B02764,2015-06-01 10:30:00,B02764,107,Manhattan,Gramercy,Yellow Zone
...,...,...,...,...,...,...,...,...
2816896,NaN,NaN,NaN,NaN,103,Manhattan,Governor's Island/Ellis Island/Liberty Island,Yellow Zone
2816897,NaN,NaN,NaN,NaN,104,Manhattan,Governor's Island/Ellis Island/Liberty Island,Yellow Zone
2816898,NaN,NaN,NaN,NaN,110,Staten Island,Great Kills Park,Boro Zone
2816899,NaN,NaN,NaN,NaN,199,Bronx,Rikers Island,Boro Zone
2816900,NaN,NaN,NaN,NaN,264,Unknown,NV,NaN

In [37]:
# drop all na values in merged data
uber1.dropna(inplace=True)

In [44]:
# group data by zone as a count
uber2 = uber1.groupby(by='zone', as_index=False).count()

In [57]:
# some zone names are conjoined together in uber data with a '/' while these places are considered separate neighborhoods in our nyc_geo data
# first split these places that are conjoined by '/'
uber2['zone'] = uber2['zone'].str.split('/')

In [60]:
# use explode to separate the split places into different rows as their own neighborhood to match nyc_geo data
uber3 = uber2.explode('zone')

In [63]:
# drop all columns except two
uber4 = uber3.drop(columns=['Dispatching_base_num', 'Pickup_date', 'Affiliated_base_num', 'locationID', 'borough', 'service_zone'])

In [90]:
# rename remaining columns to name (to match nyc_geo data) and uber_count (the data we want to join onto nyc_geo data)
uber4.columns = ['name', 'uber_count']

In [91]:
uber4.reset_index(drop=True, inplace=True)

In [93]:
# group uber data by name as a sum of their counts now
uber5 = uber4.groupby(by='name', as_index=False).sum()

In [94]:
# there is a large discrepancy between uber data names and nyc_geo names
# many of the same neighborhoods have minor differences that is making merge impossible without losing too much data (almost 50% data loss)
# another option was to artificially inflate the number of neighborhoods we had with all of these slightly different names
# the chosen method was to preserve the number of original sample points for compatibility with future data joins

# function to fully print entire dataframe for visual
def print_full(x):
    pd.set_option('display.max_rows', len(x))
    print(x)
    pd.reset_option('display.max_rows')

In [224]:
print_full(uber5)

                             name  uber_count
0                        Allerton         860
1                   Alphabet City       17608
2                        Annadale          11
3                   Arden Heights          10
4                        Arrochar         145
5                         Arverne         241
6                         Astoria       18384
7                 Astoria Heights          97
8                      Auburndale         647
9                    Baisley Park        1697
10                     Bath Beach         709
11                     Bath Beach         920
12              Battery Park City         710
13              Battery Park City       29335
14                      Bay Ridge        7586
15                    Bay Terrace         685
16                        Bayside        1964
17                   Bedford Park       17455
18                   Bedford Park        1449
19                      Bellerose         713
20                        Belmont        1692
21                    Bensonhurst        1870
22                    Bensonhurst        2245
23                     Bloomfield         195
24                   Bloomingdale        4585
25                    Boerum Hill       13985
26                   Borough Park        3653
27                   Breezy Point          42
28                      Briarwood        2339
29                 Brighton Beach        1000
30                  Broad Channel          13
31                     Bronx Park         676
32                    Bronx River         789
33                      Bronxdale         920
34               Brooklyn Heights       15627
35             Brooklyn Navy Yard        2054
36                    Brownsville        2230
37                       Bruckner         694
38                       Bushwick       16938
39                       Bushwick       22380
40                Cambria Heights         516
41                       Canarsie        3680
42                Carroll Gardens        8554
43                    Castle Hill        1045
44                 Central Harlem       13366
45                 Central Harlem       12730
46                   Central Park        9695
47                     Charleston           8
48                      Chinatown        8706
49                    City Island          85
50                   Civic Center       77462
51              Claremont Village         920
52                        Clifton         113
53                        Clinton       52539
54                   Clinton Hill       17756
55                        Clinton       31129
56                     Co-op City         930
57                    Cobble Hill        4989
58                  College Point         799
59                Columbia Street        2463
60              Concourse Village        1864
61                   Coney Island        1659
62                         Corona        2098
63                   Country Club         119
64                   Crotona Park          50
65              Crotona Park East         549
66                  Crown Heights       23194
67                  Crown Heights        5472
68                  Cypress Hills        1373
69                          Dumbo       10350
70                    Ditmas Park        9858
71                   Dongan Hills         157
72                     Douglaston         645
73                       Downtown       11381
74                  Dyker Heights        2060
75                        Chelsea       59454
76                      Concourse        1864
77                  East Elmhurst        2942
78                  East Flatbush        5816
79                       Flushing         847
80                    East Harlem       12173
81                    East Harlem       10551
82                  East New York        4505
83                   East Tremont        1155
84                   East Village       75598
85              East Williamsburg       23267
86                    Eastchester         677
87                 Edgewater Park        1020
88                   Ellis Island           1
89                       Elmhurst        7036
90                    Eltingville          11
91                   Emerson Hill         195
92                        Erasmus        2253
93                   Far Rockaway         130
94                       Farragut        2711
95                      Fieldston        3070
96             Financial District       30662
97             Financial District       11518
98                       Flatbush        9858
99                       Flatiron       42133
100                     Flatlands        3567
101           Floyd Bennett Field         185
102                      Flushing        4225
103  Flushing Meadows-Corona Park        1823
104                       Fordham         625
105                  Forest Hills        8968
106          Forest Hills Gardens         153
107                   Fort Greene       15427
108                   Fort Tilden          42
109                   Fort Totten         685
110                Fort Wadsworth         145
111                 Fresh Meadows         916
112              Garment District       30669
113                     Glen Oaks         426
114                      Glendale        1982
115             Governor's Island           1
116                       Gowanus        7860
117                      Gramercy       47060
118                     Gravesend         883
119                   Great Kills          26
120           Green-Wood Cemetery          86
121                    Greenpoint       27573
122             Greenwich Village       42293
123             Greenwich Village       36518
124                   Grymes Hill         113
125              Hamilton Heights        7165
126                       Hammels         241
127             Heartland Village         189
128                  High  Bridge        1505
129               Highbridge Park          86
130                 Highland Park         153
131                     Hillcrest        1976
132                        Hollis         398
133                     Homecrest        3413
134                  Howard Beach        1226
135                  Hudson Yards       22891
136                  Hudson Yards       55473
137                 Hunters Point       16384
138                   Hunts Point         710
139                        Inwood        3418
140                        Inwood         274
141                   JFK Airport       56765
142               Jackson Heights        8235
143                Jamaica Center        3624
144                   Jamaica Bay           1
145               Jamaica Estates        1284
146                 Jamaica Hills        2339
147                    Kensington        2635
148                   Kew Gardens        2700
149             Kew Gardens Hills        2053
150                   Kingsbridge        3379
151           Kingsbridge Heights         869
152                      Kips Bay       25057
153             LaGuardia Airport       58522
154                     Laurelton         657
155                    Lenox Hill       24740
156                    Lenox Hill       37241
157                Liberty Island           1
158                Lincoln Square       38822
159                Lincoln Square       21675
160                  Little Italy       47186
161              Long Island City       21246
162                      Longwood         623
163               Lower East Side       47749
164                       Madison        1824
165               Madison Sq West       39773
166               Manhattan Beach        1128
167              Manhattan Valley       11637
168                Manhattanville        3545
169                   Marble Hill         603
170                   Marine Park        2326
171              Mariner's Harbor          89
172                       Maspeth        5098
173                   Meatpacking       53985
174                       Melrose        1269
175                       Melrose        1394
176                     MetroTech       11381
177                Middle Village        2372
178                 Midland Beach          61
179                       Midtown       87995
180                       Midtown       55372
181                       Midtown       58465
182                 Midtown South       51954
183                       Midwood        3700
184                    Mill Basin        2141
185           Morningside Heights        9425
186                Morris Heights        1300
187                   Morris Park        1636
188                    Morrisania        1269
189                    Mott Haven        2567
190                    Mount Hope        1300
191                   Murray Hill       57652
192                   Murray Hill        1355
193                  New Brighton         142
194                      New Dorp          61
195                Newark Airport          29
196                        NoLiTa       47186
197                  North Corona         958
198               North Riverdale        3070
199                       Norwood        1561
200               Oakland Gardens         783
201                       Oakwood          45
202                    Ocean Hill        2904
203                 Ocean Parkway        1464
204                   Old Astoria        5693
205                     Olinville        1140
206                    Ozone Park        1216
207                    Park Slope       32463
208                   Parkchester         889
209                    Pelham Bay         535
210                    Pelham Bay         162
211                Pelham Gardens         860
212                Pelham Parkway        1616
213                  Penn Station       39773
214           Pennsylvania Avenue        1114
215          Peter Cooper Village       13949
216                       Pomonok        1976
217                   Port Morris        2567
218                 Port Richmond          58
219                  Prince's Bay          11
220              Prospect Heights       11125
221                 Prospect Park        1786
222     Prospect-Lefferts Gardens        8848
223                  Queens Plaza        4862
224                Queens Village        1275
225               Queensboro Hill        1378
226                  Queensbridge        1188
227               Randalls Island         888
228                    Ravenswood        1188
229                      Red Hook        5127
230                     Rego Park        2670
231                Remsen Village        3105
232                 Richmond Hill        2601
233                     Ridgewood        5827
234                    Riis Beach          42
235                     Riverdale        3070
236                 Rockaway Park         156
237              Roosevelt Island         638
238                      Rosedale         822
239                     Rossville           5
240                  Saint Albans        1187
241                  Saint George         142
242       Saint Michaels Cemetery          86
243                 Schuylerville        1020
244                       Seaport        9244
245                   Seward Park       15044
246                Sheepshead Bay        1614
247                          Soho       41476
248                     Soundview        1739
249                   South Beach         157
250                 South Jamaica         917
251              South Ozone Park        2622
252                  Williamsburg        1998
253           Springfield Gardens         744
254           Springfield Gardens        1000
255                Spuyten Duyvil        3379
256                     Stapleton         157
257                 Starrett City         559
258                      Steinway        9831
259               Stuyvesant Town       13949
260               Stuyvesant Town       13007
261                     Sunnyside       11522
262                   Sunset Park        2056
263                   Sunset Park        7383
264                  Sutton Place       33381
265              Theatre District       62414
266                      Times Sq       62414
267                     Todt Hill         189
268                   Tottenville           8
269                       Tribeca       77462
270                    Turtle Bay       33381
271                    Turtle Bay       29658
272                   Two Bridges       15044
273                            UN       29658
274                      Union Sq       76718
275                     Unionport         968
276            University Heights        1300
277               Upper East Side       41709
278               Upper East Side       52535
279               Upper West Side       26108
280               Upper West Side       36075
281            Van Cortlandt Park         380
282         Van Cortlandt Village        1664
283                      Van Nest        1636
284                  Vinegar Hill       10350
285                     Wakefield         810
286            Washington Heights        7847
287            Washington Heights       10527
288                 West Brighton         106
289                       Chelsea       55473
290                     Concourse        3537
291                    West Farms         789
292                  West Village       57991
293                  West Village       53985
294           Westchester Village         968
295                   Westerleigh         157
296                    Whitestone        1084
297                 Willets Point         284
298                Williamsbridge        1140
299                  Williamsburg       42274
300                  Williamsburg       28412
301               Windsor Terrace        4733
302                     Woodhaven        2058
303                      Woodlawn         810
304                       Woodrow           5
305                      Woodside        4567
306            World Trade Center       14239
307                     Yorkville       20909
308                     Yorkville       25910

In [223]:
# manually update all discrepancies by manually cross-referencing between uber data names and nyc_geo data names
uber5.at[308, 'name'] = "Yorkville"

In [85]:
# read nyc_geo data
nyc_geo = pd.read_csv('nyc_geo_dataframe.csv')

In [87]:
# sorting for clarity
nyc_geo1 = nyc_geo.sort_values(by='name')

In [225]:
# noticed that there were duplicate names in the nyc_geo data (they had slightly different coordinates but were largely the same place)
nyc_geo2 = nyc_geo1.drop_duplicates(subset='name', keep='first')

In [227]:
uber6 = uber5.groupby(by='name').sum()

In [229]:
# merge completed uber data and nyc_geo data
nyc_uber = nyc_geo2.merge(uber6, how='left', on='name')

In [232]:
# fill all na values in merged data with 0 (this may be changed later as needed)
nyc_uber.fillna(value=0, inplace=True)

In [233]:
nyc_uber

              name  longitude   latitude  uber_count
0         Allerton -73.859319  40.865788       860.0
1         Annadale -74.178549  40.538114        11.0
2    Arden Heights -74.185887  40.549286        10.0
3        Arlington -74.165104  40.635325         0.0
4         Arrochar -74.067124  40.596313       145.0
..             ...        ...        ...         ...
297      Woodhaven -73.858110  40.689887      2058.0
298       Woodlawn -73.867315  40.898273       810.0
299        Woodrow -74.205246  40.541968         5.0
300       Woodside -73.901842  40.746349      4567.0
301      Yorkville -73.947118  40.775930     46819.0

[302 rows x 4 columns]

In [234]:
# save merge data as csv
nyc_uber.to_csv('nyc_uber_data.csv', index=False)